In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('RequestAccepted')

+--------------+-------------+-------------+
| requester_id | accepter_id | accept_date |
+--------------+-------------+-------------+
|      1       |      2      |  2016-06-03 |
|      1       |      3      |  2016-06-08 |
|      2       |      3      |  2016-06-08 |
|      3       |      4      |  2016-06-09 |
+--------------+-------------+-------------+

### Write an SQL query to find the people who have the most friends and the most friends number.

#### *The test cases are generated so that only one person has the most friends.The query result format is in the following example.*

```
+----+-----+
| id | num |
+----+-----+
| 3  | 3   |
+----+-----+
Explanation: 
The person with id 3 is a friend of people 1, 2, and 4, so he has three friends in total, which is the most number than any others.
```

In [3]:
%%sql 

SELECT requester_id 
FROM RequestAccepted

UNION ALL 

SELECT accepter_id 
FROM RequestAccepted

[(1,), (1,), (2,), (3,), (2,), (3,), (3,), (4,)]

In [4]:
%%sql 

SELECT 
    union_table.id AS id,
    COUNT(union_table.id) AS num 
FROM (
    SELECT requester_id AS id
    FROM RequestAccepted
    UNION ALL 
    SELECT accepter_id AS id
    FROM RequestAccepted
) AS union_table
GROUP BY id

[(1, 2), (2, 2), (3, 3), (4, 1)]

In [5]:
%%sql 

SELECT 
    union_table.id AS id,
    COUNT(union_table.id) AS num 
FROM (
    SELECT requester_id AS id
    FROM RequestAccepted
    UNION ALL 
    SELECT accepter_id AS id
    FROM RequestAccepted
) AS union_table
GROUP BY id 
ORDER BY num DESC

[(3, 3), (1, 2), (2, 2), (4, 1)]

In [6]:
%%sql 

SELECT 
    union_table.id AS id,
    COUNT(union_table.id) AS num 
FROM (
    SELECT requester_id AS id
    FROM RequestAccepted
    UNION ALL 
    SELECT accepter_id AS id
    FROM RequestAccepted
) AS union_table
GROUP BY id 
ORDER BY num DESC
LIMIT 1;

[(3, 3)]